Revit 2024 API
UITheme Enumeration
 The application frame theme.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public enum UITheme
Visual Basic
Public Enumeration UITheme
Visual C++
public enum class UITheme
Members
Member name | Description
Dark |  Dark.
Light |  Light.
See Also
Autodesk.Revit.UI Namespace